<a href=https://uplimit.com/course/r-for-data-science>
  <img src=https://imgur.com/6Vkc11w.png />
</a>

|        |                                   |                                   |                                 |                                |
| -------| ----------------------------------| -------------------------------- -| --------------------------------| ------------------------------------------|
| Week 1 | [[01] Doing Data Science](https://colab.research.google.com/drive/1aWpmzS36qVc8hNIaSSSHexlodwwyMJCB)           | [[02] Data Science in Action](https://colab.research.google.com/drive/1aWpmzS36qVc8hNIaSSSHexlodwwyMJCB)       | [[03] Importing Data](https://colab.research.google.com/drive/13kHBX3H1F2yx5yXWJ5iFZh48qjEtpLjU)             | [[04] Visualizing Data: Overview](https://colab.research.google.com/drive/1JSeDt-Gneegd5B2KwWTJF_igYPb-xsIv)          |
|        | [[05] Transforming Data: Overview](https://colab.research.google.com/drive/1IMZJFE8WmwjgdYCddvaO386PljKq_PjC)  | [[06] Transforming Data: Manipulate](https://colab.research.google.com/drive/19ClnAH7d30I9PkD9KuZndPmy5hxk3gdi) |                                 |                                           |
| Week 2 | [[07] Transforming Data: Aggregate](https://colab.research.google.com/drive/1zigvePewKpzKQHx2pjABXU6Ms8QzQXj7) | [[08] Transforming Data: Reshape](https://colab.research.google.com/drive/1Ma9VrM9SrkNEeXTSul0Ca8a7GHAeNLzC)   | [[09] Transforming Data: Combine](https://colab.research.google.com/drive/1JUGm1h4YPmCkre-rVUj5Ql7lBS66_xIs) | [[10] Visualizing Data: Grammar of Graphics](https://colab.research.google.com/drive/1YLE3NPp-TO2KUTohtidjzKMeqJVWxYoT) |
|        | [[11] Data Science in Action Again](https://colab.research.google.com/drive/1eWjVK4oEiXdwdP4sT0nOJlmkCMBkfLpz) |                                   |                                 |                                           |
Books | [Hands on Programming with R](https://rstudio-education.github.io/hopr/index.html) | [R for Data Science](https://r4ds.hadley.nz/) | [Elegant Graphics for Data Analysis](https://ggplot2-book.org/)

> ðŸ“• __BEFORE YOU GET STARTED:__
> 1. Click on **Copy to Drive** to copy notebook to your drive.
> 2. Click on **Share** on the top-right corner (of your copied notebook).
> 3. Update sharing settings to **Anyone with link**
> 4. Delete this cell.

In [ ]:
library(tidyverse)
diamonds <- diamonds |>
  filter(carat < 3) |>
  slice_sample(n = 500)

head(diamonds)

  carat cut       color clarity depth table price x    y    z
1 0.57  Ideal     G     VVS2    60.7  55     2206 5.36 5.34 3.25
2 0.51  Ideal     D     SI1     62.6  57     1619 5.11 5.08 3.19
3 0.30  Very Good G     VVS1    62.7  59      789 4.22 4.27 2.66
4 0.76  Ideal     F     VS2     61.6  55     2725 5.88 5.90 3.63
5 2.00  Ideal     I     SI1     62.8  56    15043 8.04 7.95 5.02
6 0.72  Very Good J     SI1     61.1  57     1866 5.75 5.80 3.53

In [ ]:
diamonds |>
  slice_sample(n = 5)

  carat cut       color clarity depth table price x    y    z
1 1.12  Ideal     F     SI2     61.6  57    4720  6.68 6.66 4.11
2 0.56  Ideal     F     VS1     61.7  56    1915  5.30 5.33 3.28
3 0.70  Good      E     VS1     59.8  62    2973  5.74 5.80 3.45
4 0.40  Very Good E     SI2     63.2  57     855  4.68 4.66 2.95
5 0.40  Ideal     F     VVS2    60.1  57     990  4.78 4.83 2.89

## Aggregating Data

__Aggregating__ data involves summarizing the data at a higher level than the original data, such as computing the `mean`, `sum`, or `count` of values for different `groups` of data. The two primary functions that you will use to aggregate data are:

<img src="https://i.imgur.com/BMjwi2P.png" />

- `group_by()`: This function is used to group data by one or more variables. The result is a `grouped_df` object, which can then be used with other `dplyr` functions to aggregate the data.

- `summarize()` or `summarise()`: These functions are used to compute summary statistics for each group of data. For example, you can compute the `mean()`, `median()`, `sum()`, or `count()` of values in each group.

Additionally, the grammar of data manipulation provided by `tidyverse` allows us to utilize the full power of data manipulation operations like `mutate()`, `filter()`, `arrange()` etc. to grouped data as well.

Let us load the `tidyverse` and read the babynames data so we can use it to explore data aggregation.

In [ ]:
# Load packages and common utility functions
library(tidyverse)
url = "https://gist.githubusercontent.com/ramnathv/e71d3ffe88961fc4ef95642053012384/raw/9dda53562d06009912841ab3538d4aeb90e5ee09/_common.R"
download.file(url, basename(url))
source("_common.R")

Installing package into â€˜/usr/local/lib/R/site-libraryâ€™
(as â€˜libâ€™ is unspecified)

Tracing function "install.packages" in package "utils"

Tracing function "update.packages" in package "utils"

Installing packages into â€˜/usr/local/lib/R/site-libraryâ€™
(as â€˜libâ€™ is unspecified)

Inspecting installed packages...

In [ ]:
file_name_names <- "https://raw.githubusercontent.com/ramnathv/corise-r-for-ds/main/data/names.csv.gz"
tbl_names <- readr::read_csv(file_name_names, show_col_types = FALSE)
head(tbl_names)

  year name      sex nb_births
1 1880 Mary      F   7065
2 1880 Anna      F   2604
3 1880 Emma      F   2003
4 1880 Elizabeth F   1939
5 1880 Minnie    F   1746
6 1880 Margaret  F   1578

### `group_by()`: Group by one or more variables

The `group_by()` function lets you group a table by one or more columns. Applying the `group_by` function to a table does not change its appearance, except for adding some metadata on the grouping variables.

In [ ]:
# Group by ONE column
tbl_names |>
  group_by(sex) |>
  head()

  year name      sex nb_births
1 1880 Mary      F   7065
2 1880 Anna      F   2604
3 1880 Emma      F   2003
4 1880 Elizabeth F   1939
5 1880 Minnie    F   1746
6 1880 Margaret  F   1578

In [ ]:
# Group by multiple columns
tbl_names |>
  group_by(sex, name) |>
  head()

  year name      sex nb_births
1 1880 Mary      F   7065
2 1880 Anna      F   2604
3 1880 Emma      F   2003
4 1880 Elizabeth F   1939
5 1880 Minnie    F   1746
6 1880 Margaret  F   1578

### `summarize()`: Summarize each group down to one row

The reason we group a table by columns is to be able to manipulate it by group. While the `group_by` function can be used in tandem with several other manipulation functions, the most common function used is the `summarize` function. It aggregates the data for each group such that there is only ONE row per group.

You can use any arbitrary function inside `summarize` as long as it collapses multiple values into a single value. For example, we can summarize the `babynames` dataset for each `sex` in terms of the total number of births and number of distinct names.

In [ ]:
tbl_names |>
  group_by(sex) |>
  summarize(
    nb_births = sum(nb_births),
    nb_names = n_distinct(name)
  )

  sex nb_births nb_names
1 F   179027755 69527
2 M   182860478 43093

How about we try grouping by multiple variables? Let us compute the same summaries, but grouping by `sex` and `year` this time.

In [ ]:
tbl_names |>
  group_by(sex, year) |>
  summarize(
    nb_births = sum(nb_births),
    nb_names = n_distinct(name)
  ) |>
  head()

`summarise()` has grouped output by 'sex'. You can override using the `.groups`
argument.

  sex year nb_births nb_names
1 F   1880  90994     942
2 F   1881  91953     938
3 F   1882 107847    1028
4 F   1883 112319    1054
5 F   1884 129019    1172
6 F   1885 133055    1197

It is very important to pay attention to the message that gets printed.

```
#> `summarize()` has grouped output by 'sex'. You can override using the `.groups`
#> argument.
```

When you group by multiple variables, each summarize operation removes only the last level of grouping. For example, in this case, the grouping by `year` was removed, but the grouping by `sex` is still retained. This design has some advantages as it lets us do hierarchical summaries without having to invoke multiple `group_by` operations. However, it can also introduce nasty surprises if you are not careful.

My recommendation would be to override this default behavior and always drop all grouping after a summarize operation. This might add some overhead especially if you are going to group it again. But doing that explicitly will save you a lot of pain.

In [ ]:
tbl_names |>
  group_by(sex, year) |>
  summarize(
    nb_births = sum(nb_births),
    nb_names = n_distinct(name),
    .groups = "drop"
  ) |>
  head()

`summarise()` has grouped output by 'sex'. You can override using the `.groups`
argument.

  sex year nb_births nb_names
1 F   1880  90994     942
2 F   1881  91953     938
3 F   1882 107847    1028
4 F   1883 112319    1054
5 F   1884 129019    1172
6 F   1885 133055    1197

While, you can apply any of the data manipulation verbs in the `tidyverse` to a grouped data frame, there are some that are going to be used more than the others.

### `mutate()`: Create, modify, and delete columns

A grouped data frame is just like a normal data frame EXCEPT that any operation you do on it is applied to each group separately. For example, suppose you want to compute the percentage of births in a year by `sex` and `name`. You can group by `sex` and `name` and use the `mutate()` function to add a column for the total number of births for each group, and then use that to compute the percentages.

Let us now `ungroup()` the data, `filter()` for names with more than 50,000 births and `arrange()` them in descending order of births, so we can see how some names have a lion's share of births happening in a few years. For example, 40% of all Lunas were born in the years 2019, 2020, and 2021

In [ ]:
tbl_names |>
  group_by(sex, name) |>
  mutate(
    nb_births_total = sum(nb_births),
    pct_births_in_year = nb_births / nb_births_total
  ) |>
  ungroup() |>
  filter(nb_births_total > 50000) |>
  arrange(desc(pct_births_in_year)) |>
  head()

  year name sex nb_births nb_births_total pct_births_in_year
1 2021 Luna F   8173      57494           0.1421540
2 2020 Luna F   7818      57494           0.1359794
3 2019 Luna F   7778      57494           0.1352837
4 2018 Mila F   8158      61710           0.1321990
5 2018 Luna F   6931      57494           0.1205517
6 2019 Mila F   7330      61710           0.1187814

Note that it is very important to ungroup the data using `ungroup()` before applying any data frame wide operations. It is more efficient to operate on whole data frames and grouped operations are always going to be slower.

### `across()`: Apply a function across multiple columns

Finally, there are situations where you might want to apply a function across multiple columns. This is where the `across()` function comes very handy. You can use different selector functions available to summarize a group of columns without having to write multiple lines of code. Shown below are two examples, where we summarize the mean of a number of columns of the data by `cut`.

- In the first example, we select the columns to summarize across by name
- In the second example, we select the columns to summarize across by their data type.

In [ ]:
# Summarize multiple columns by name
diamonds |>
  group_by(cut) |>
  summarize(across(c(carat, price), mean)) |>
  head()

  cut       carat     price
1 Fair      1.0461366 4358.758
2 Good      0.8491847 3928.864
3 Very Good 0.8063814 3981.760
4 Premium   0.8919549 4584.258
5 Ideal     0.7028370 3457.542

In [ ]:
# Summarize multiple columns by data type
diamonds |>
  group_by(cut) |>
  summarize(across(where(is.numeric), mean)) |>
  head()

  cut       carat     depth    table    price    x        y        z
1 Fair      1.0461366 64.04168 59.05379 4358.758 6.246894 6.182652 3.982770
2 Good      0.8491847 62.36588 58.69464 3928.864 5.838785 5.850744 3.639507
3 Very Good 0.8063814 61.81828 57.95615 3981.760 5.740696 5.770026 3.559801
4 Premium   0.8919549 61.26467 58.74610 4584.258 5.973887 5.944879 3.647124
5 Ideal     0.7028370 61.70940 55.95167 3457.542 5.507451 5.520080 3.401448